<?PHP

declare( strict_types = 1 );

namespace DiYi;


class ResponseCode
{
    public static array $status = [
        200 => '成功',
        403 => '参数错误',
        429 => '操作频繁(请求过多/过快等)',
        500 => '内部服务错误',
        1000 => '签名Header缺失',
        1001 => '签名验证失败',
        1002 => '币种不支持',
        1003 => '没有权限',
        1004 => '交易不存在',
        1005 => 'Api key没有权限',
        1006 => 'IP不在白名单',
        1007 => '余额不足',
        1008 => '币种暂时不可用',
        1009 => '重复的提现ID',
        1010 => '账户已被冻结',
        1011 => '金额过小',
        1012 => '地址格式错误',
        1013 => '地址不在白名单内',
        1014 => '手续费设置错误',
        1015 => '地址不存在',
        1016 => '无效时间',
        1017 => '不支持的链',
        1018 => '不支持的代币',
        1019 => '暂停提现',
        1020 => '转账失败',
        1021 => '商户不存在',
        1022 => '域名不在白名单内',
        1023 => '商户被冻结',
        1024 => '未绑定提现地址信息',
    ];
}
